tutorials/combustion/reactingFoam/RAS/membrane/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletSleeve
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    inletPipe
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    wall
    {
        type            noSlip;
    }
    membraneSleeve
    {
        type            semiPermeableBaffleVelocity;
        value           $internalField;
    }
    membranePipe
    {
        type            semiPermeableBaffleVelocity;
        value           $internalField;
    }
}


// ************************************************************************* //
